Revit 2027 API
ParameterTypeId.SweepBaseFloorSubcategoryId Property
 "Subcategory of Floors"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SweepBaseFloorSubcategoryId { get; }
Public Shared ReadOnly Property SweepBaseFloorSubcategoryId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SweepBaseFloorSubcategoryId {
	ForgeTypeId^ get ();
}
static member SweepBaseFloorSubcategoryId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace